In [1]:
%pip install pandas

Requirement already satisfied: pandas in c:\users\ompra\appdata\local\programs\python\python313\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\ompra\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.2.5)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\ompra\appdata\roaming\python\python313\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\ompra\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\ompra\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\ompra\appdata\roaming\python\python313\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.3.1 -> 25.1.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
import pandas as pd
df=pd.read_csv('data.csv')
df

   Unnamed: 0.1  Unnamed: 0  sn name  age        add
0             0           0   1  Ram   34  Kathmandu

In [ ]:
# To save to csv file
df=df[df['add']=='Kathmandu']
df.to_csv('data.csv')

In [59]:
# to save json file
df=df[df['name']=='Ram']

df.to_json('filter_data.json')

In [3]:
# to read json
df=pd.read_json('filter_data.json')
df

   Unnamed: 0.1  Unnamed: 0  sn name  age        add
0             0           0   1  Ram   34  Kathmandu

In [4]:
# List inside list to csv
import csv
data=[['name','age','add'],
      ['ram',34,'kathmandu'],
      ['shyam',45,'bhaktapur'],
      ['hari',45,'lalitpur']]
file=open('list_data.csv','w')
x=csv.writer(file)
x.writerows(data)
file.close()

In [5]:
df=pd.read_csv('list_data.csv')
df

    name  age        add
0    ram   34  kathmandu
1  shyam   45  bhaktapur
2   hari   45   lalitpur

In [15]:
import pandas as pd
data=[
      ['ram',34,'kathmandu'],
      ['shyam',45,'bhaktapur'],
      ['hari',45,'lalitpur']]

df=pd.DataFrame(data,columns=['Name','Age','Add'])
df.to_csv('list_data.csv')

In [16]:
df=pd.read_csv('list_data.csv')
df

   Unnamed: 0   Name  Age        Add
0           0    ram   34  kathmandu
1           1  shyam   45  bhaktapur
2           2   hari   45   lalitpur

In [20]:
# List indide dictionary to csv
data={
    'sn': [1, 2, 3],
    'name':['Ram','Shyam','Hari'],
    'age':[34,45,23],
    'add':['Kathmandu','Nautan','Lalitpur']
}
df=pd.DataFrame(data) # convert to dataframe
df.to_csv('list_data.csv') #save to csv
# df

In [21]:
df=pd.read_csv('list_data.csv',index_col='sn') # read csv
df

    Unnamed: 0   name  age        add
sn
1            0    Ram   34  Kathmandu
2            1  Shyam   45     Nautan
3            2   Hari   23   Lalitpur

In [85]:
import csv
with open('data.csv') as csvfile:
    reader=csv.DictReader(csvfile)
    for row in reader:
        print(row)
       
    # print([i for i in reader])

{'': '0', 'Unnamed: 0': '0', 'sn': '1', 'name': 'Ram', 'age': '34', 'add': 'Kathmandu'}

In [86]:
import csv
with open('data.csv') as csvfile:
    reader=csv.DictReader(csvfile)

    print([i for i in reader])

[{'': '0', 'Unnamed: 0': '0', 'sn': '1', 'name': 'Ram', 'age': '34', 'add': 'Kathmandu'}]

In [25]:
df=pd.read_csv('list_data.csv')
df.drop([1],axis=0)
# df.drop('Unnamed: 0',axis=1) # 0 represents row and 1 represents column

   Unnamed: 0  sn  name  age        add
0           0   1   Ram   34  Kathmandu
2           2   3  Hari   23   Lalitpur

In [72]:
df=pd.read_csv('list_data.csv',index_col='sn')

df.drop('Unnamed: 0',axis=1) # 0 represents row and 1 represents column

     name  age        add
sn
1     Ram   34  Kathmandu
2   Shyam   45     Nautan
3    Hari   23   Lalitpur